---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctInsulation
source: html/f81a44d8-6ccf-c5b8-f2ca-55e547eff956.htm
---
# Autodesk.Revit.DB.Mechanical.DuctInsulation

Represents insulation applied to the outside of a given duct , fitting or accessory.

## Syntax (C#)
```csharp
public class DuctInsulation : InsulationLiningBase
```